const fns = require('date-fns')

const mock = [
    {
        "id": 1,
        "title": "Стартовая встреча проекта",
        "start": "2022-12-01"
    },
    {
        "id": 2,
        "title": "Запуск продукта",
        "start": "2022-12-03T10:00:00"
    },
    {
        "id": 3,
        "title": "Обучение продукту.",
        "start": "2022-12-04T10:00:00"
    },
    {
        "id": 4,
        "title": "Демонстрация продукта",
        "start": "2022-12-04T11:00:00"
    },
    {
        "id": 5,
        "title": "Экзамен продукта",
        "start": "2022-12-04T12:00:00"
    },
    {
        "id": 6,
        "title": "Мониторинг и оповещение о дизайне сервисов",
        "start": "2022-12-06T10:00:00"
    },
    {
        "id": 7,
        "title": "Мозговой штурм дизайн-системы",
        "start": "2022-12-06T11:00:00"
    },
    {
        "id": 8,
        "title": "Обзор тестового примера",
        "start": "2022-12-16T14:00:00"
    },
    {
        "id": 9,
        "title": "Обзор разработки разработки",
        "start": "2022-12-16T16:00:00"
    },
    {
        "id": 10,
        "title": "Встреча продукта",
        "start": "2022-12-05T09:00:00",
        "end": "2022-12-05T10:30:00"
    },
    {
        "id": 11,
        "title": "Кодирование ",
        "start": "2022-12-05T10:00:00",
        "end": "2022-12-05T11:30:00"
    },
    {
        "id": 12,
        "title": "Подготовки руководящих кадров",
        "start": "2022-12-05T12:00:00",
        "end": "2022-12-05T14:00:00"
    },
    {
        "id": 13,
        "title": "Послеобеденное чаепитие",
        "start": "2022-12-05T14:00:00",
        "end": "2022-12-05T16:00:00"
    },
    {
        "id": 14,
        "title": "Интервью инженеров.",
        "start": "2022-12-05T16:00:00",
        "end": "2022-12-05T18:00:00"
    },
    {
        "id": 15,
        "title": "Выпуск продукта",
        "start": "2022-12-31T14:00:00"
    },
    {
        "id": 16,
        "title": "Принятие продукта",
        "start": "2022-12-31T16:00:00"
    }
]

module.exports = { mock } 